---
kind: method
id: M:Autodesk.Revit.DB.FabricationPart.CanAdjustEndLength(Autodesk.Revit.DB.Connector)
source: html/af1e4f76-c569-48cc-0433-df9abf12da08.htm
---
# Autodesk.Revit.DB.FabricationPart.CanAdjustEndLength Method

Checks if the end of fabrication part can be adjusted.

## Syntax (C#)
```csharp
public bool CanAdjustEndLength(
	Connector connector
)
```

## Parameters
- **connector** (`Autodesk.Revit.DB.Connector`) - The connector of the fabrication part to adjust length.

## Returns
True if the end of fabrication part can be adjusted.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null